improve diagram and table.
